Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In addition, the xref:tooling.adoc[tooling guide] document explains how to:
ja_jp: また、xref:tooling.adoc[ツールガイド] のドキュメントでは、以下について説明しています。

source: In all other cases, the cache key is an instance of `io.quarkus.cache.CompositeCacheKey` built from multiple method arguments (annotated with `@CacheKey` or not).
ja_jp: それ以外の場合、キャッシュキーは、複数のメソッド引数（ `@CacheKey` でアノテーションされているかどうか）から構築された `io.quarkus.cache.CompositeCacheKey` のインスタンスです。

source: In an effort to make development errors very easy to diagnose, Quarkus provides various detailed error pages when running in dev mode.
ja_jp: 開発エラーの診断を非常に簡単にするために、Quarkus は開発モードでの実行時に様々な詳細なエラーページを提供しています。

source: In an effort to make development errors very easy to diagnose, Quarkus provides various detailed error pages when running in dev-mode.
ja_jp: 開発エラーの診断を非常に簡単にするために、Quarkusは開発モードでの実行時に様々な詳細なエラーページを提供しています。

source: In an effort to make your REST resources less verbose and considering nowadays JSON is the most widely used content type for REST services, it is now the default in Quarkus for your REST resources.
ja_jp: REST リソースを冗長にならないようにするための努力と、最近では JSON が REST サービスで最も広く使用されているコンテンツタイプであることを考慮して、Quarkus では REST リソースのデフォルトとして JSON が使用されるようになりました。

source: In another terminal, emit a few HTTP POST request such as:
ja_jp: 別の端末で、次のようなHTTP POSTリクエストをいくつか送信します:

source: In another terminal, invoke the application using curl and gets its memory usage:
ja_jp: 別の端末で、curlを使ってアプリケーションを起動し、そのメモリ使用量を取得します。

source: In another terminal, run `curl localhost:8080/count` to check the counter value. After a few seconds, re-run `curl localhost:8080/count` to verify the counter has been incremented.
ja_jp: 別のターミナルで、 `curl localhost:8080/count` を実行し、カウンタの値を確認します。 数秒後、 `curl localhost:8080/count` を再実行し、カウンタが増分されたことを確認します。

source: In another terminal, run:
ja_jp: 別の端末で、次を実行します。

source: In another:
ja_jp: 別のターミナルで以下を実行します。

source: In any case, if you see unexpected results, we're very interested in your feedback. Please reach out to us, and we'll guide you on how to gather useful profiling information.
ja_jp: いずれにせよ、予期せぬ結果が見られた場合は、ぜひフィードバックをお寄せください。ご連絡いただければ、有用なプロファイリング情報を収集する方法をご案内します。

source: In both aforementioned scenarios, a password needs to be provided to create/load the keystore with. The password can be set in your `application.properties` (in plain-text) using the following property:
ja_jp: 前述のいずれのシナリオでも、キーストアを作成/ロードするためにパスワードを指定する必要があります。パスワードは、以下のプロパティーを使用して `application.properties` で (プレーンテキストで) 設定できます。

source: In both cases the configuration will be automatically parsed by the native build, without additional configuration.
ja_jp: どちらの場合も、追加の設定なしで、ネイティブビルドによって設定が自動的に解析されます。

source: In both cases we advise that you add support for the Dev UI in your `{pkg}.deployment.devconsole` package in a `DevConsoleProcessor` class (in your extension's xref:building-my-first-extension.adoc#description-of-a-quarkus-extension[`deployment`] module).
ja_jp: どちらの場合も、 `{pkg}.deployment.devconsole` パッケージの Dev UI のサポートを、 `DevConsoleProcessor` クラス (エクステンションの link:building-my-first-extension.html#description-of-a-quarkus-extension[`deployment`]モジュール)に追加することをお勧めします。

source: In both cases, a password must be provided. See the designated paragraph for a detailed description of how to provide it.
ja_jp: いずれの場合も、パスワードを提供する必要があります。提供方法の詳細については、提供方法に関する段落を参照してください。

source: In both cases, if the user is successfully authenticated, the landing page will show the user's name and e-mail. Even though user `alice` exists in both tenants, for the application they are distinct users belonging to different realms/tenants.
ja_jp: どちらの場合も、ユーザーが正常に認証されると、ランディングページにユーザーの名前と電子メールが表示されます。ユーザー `alice` は両方のテナントに存在しますが、アプリケーションにおいて、それらは異なるレルム/テナントに属する別個のユーザーです。

source: In both cases, importing those modules will allow HTTP message bodies to be read from JSON and serialised to JSON, for <<resource-types,all the types not already registered with a more specific serialisation>>.
ja_jp: どちらの場合も (<<resource-types,all the types not already registered with a more specific serialisation>>)、これらのモジュールをインポートすると、HTTP メッセージ本文を JSON から読み取って JSON にシリアル化できます。

source: In both cases, the landing page shows the user's name and email if the user is successfully authenticated. Although `alice` exists in both tenants, the application treats them as distinct users in separate realms.
ja_jp: どちらの場合も、ユーザーが正常に認証されると、ランディングページにユーザーの名前とメールアドレスが表示されます。 `alice` は両方のテナントに存在しますが、アプリケーションはそれらを別々のレルム内の別個のユーザーとして扱います。

source: In both cases, you need to start the REST API by enabling the Podman socket service through systemd, or at least by making sure Podman is running as a service.
ja_jp: どちらの場合も、systemdを通してPodmanソケットサービスを有効にするか、少なくともPodmanがサービスとして稼働しているようにして、REST APIを開始する必要があります。

source: In both native executable and pure JVM mode this allows the app to start as fast as possible since processing was done during build time. This also minimizes the classes/native code needed in the application to pure runtime related behaviors.
ja_jp: ネイティブ実行可能ファイルとピュアJVMの両方のモードで、これによりビルド時に処理が行われたため、アプリを可能な限り高速に起動することができます。また、アプリケーションに必要なクラスやネイティブコードを最小限に抑え、純粋な実行時関連の動作を実現します。

source: In case a remote Maven repository requires link:https://maven.apache.org/guides/mini/guide-repository-ssl.html[authenticated HTTPS access configuration], some or all of the following properties will need to be passed to the test plugins:
ja_jp: リモート Maven リポジトリが link:https://maven.apache.org/guides/mini/guide-repository-ssl.html[認証された HTTPS アクセス設定] を必要とする場合、以下のプロパティの一部またはすべてをテストプラグインに渡す必要があります：

source: In case an application is importing more than one Quarkus platform and those platforms include their own platform properties artifacts, the content of those platform properties artifacts will be merged to form a single set of properties that will be used for the application build. The order in which the properties artifacts are merged will correspond to the order in which they appear in the list of dependency version constraints of the application (in the Maven terms that will correspond to the effective list of application's managed dependencies, i.e. the flattened `managedDependencies` POM section).
ja_jp: アプリケーションが複数のQuarkusプラットフォームをインポートしており、それらのプラットフォームが独自のプラットフォームプロパティアーティファクトを含んでいる場合、それらのプラットフォームプロパティアーティファクトのコンテンツは、アプリケーションのビルドに使用される単一のプロパティセットを形成するためにマージされます。プロパティアーティファクトがマージされる順番は、アプリケーションの依存関係バージョン制約のリストに表示される順番に対応します（Maven用語では、アプリケーションの管理された依存関係の実際のリスト、すなわちフラット化された `managedDependencies` POMセクションに対応します）。

source: In case of CDI, there must be exactly one bean that has the class in its set of bean types, otherwise the build fails. The context associated with the scope of the bean must be active when the `CacheKeyGenerator#generate()` method is invoked. If the scope is `@Dependent` then the bean instance is destroyed when the `CacheKeyGenerator#generate()` method completes.
ja_jp: CDIの場合，そのBean型の集合にそのクラスをもつBeanが正確に一つ存在しなければならず，そうでない場合，ビルドは失敗します。 Beanのスコープに関連付けられたコンテキストは， `CacheKeyGenerator#generate()` メソッドが呼び出されるとき，有効でなければなりません。 スコープが `@Dependent` の場合， `CacheKeyGenerator#generate()` メソッドが完了すると，Bean インスタンスは破棄されます。

source: In case of a custom XML format mapper, a different CDI qualifier must be applied:
ja_jp: カスタム XML 形式マッパーの場合は、別の CDI 修飾子を適用する必要があります。

source: In case of ambiguity, Spring uses a fallback match of the bean name against the injection point field name or parameter name. This is not supported, thus `@Named` annotation needs to be used to explicitly solve any ambiguity.
ja_jp: 曖昧な場合、SpringはBean名と注入ポイントのフィールド名やパラメータ名の照合を行います。これはサポートされていないので、 `@Named` アノテーションを使用して曖昧さを明示的に解決する必要があります。

source: In case of in-memory channels, `@Broadcast` annotation can be used on the `@Outgoing` method. For example,
ja_jp: インメモリーチャネルの場合、 `@Broadcast` アノテーションを `@Outgoing` メソッドで使用できます。以下に例を示します。

source: In case of multiple configured `OidcClient` objects, you can specify the `OidcClient` injection target by the extra qualifier `@NamedOidcClient` instead of working with `OidcClients`:
ja_jp: 複数の `OidcClient` オブジェクトが設定されている場合、 `OidcClients` を使用する代わりに、追加の修飾子 `@NamedOidcClient` で `OidcClient` の注入ターゲットを指定できます。

source: In case of multiple configured ``OidcClient``s you can specify the `OidcClient` injection target by the extra qualifier `@NamedOidcClient` instead of working with `OidcClients`:
ja_jp: 複数の設定済みの ``OidcClient``s の場合は、 `OidcClients` で作業する代わりに、追加の修飾子 `@NamedOidcClient` で `OidcClient` 注入ターゲットを指定できます。

source: In case of overlapping paths in the configuration, you can specify an order (higher values take precedence). For example, having the following configuration:
ja_jp: 設定でパスが重複している場合、順序を指定することができます ( 値の大きい方が優先されます ) 。例えば、以下のような設定を持つ場合を考えます。

source: In case of the optimistic locking API, if the pre-transaction block returns successfully (or completes with an item in case of the reactive API), the transaction is started and execution proceeds to the transaction block. If the pre-transaction block throws an exception (or completes with a failure in case of the reactive API), all watched keys are ``UNWATCH``ed automatically and the exception is rethrown (or the resulting `Uni` completes with the same failure in case of the reactive API). In this case, the transaction is not started and the transaction block is not executed.
ja_jp: 楽観的ロック API の場合、事前トランザクションブロックが正常に終了すると (リアクティブ API の場合はアイテムとともに完了すると)、トランザクションが開始され、処理がトランザクションブロックに進みます。事前トランザクションブロックが例外をスローした場合 (リアクティブ API の場合は失敗で完了した場合)、監視されているすべてのキーが自動的に `UNWATCH` され、例外が再スローされます (リアクティブ API の場合は、結果の `Uni` が同じ失敗で完了します)。この場合、トランザクションは開始されず、トランザクションブロックも実行されません。

source: In case that both properties are used with conflicting values `-Dquarkus.kubernetes.deployment-target` is used.
ja_jp: 両プロパティーが相反する値で使用されている場合、`-Dquarkus.kubernetes.deployment-target` が使用されます。

source: In case that both properties are used with conflicting values `quarkus.kubernetes.deployment-target` is used.
ja_jp: 両プロパティーが相反する値で使用されている場合、`quarkus.kubernetes.deployment-target` が使用されます。

source: In case you are interested in using the `Flyway` object directly, you can inject it as follows:
ja_jp: `Flyway` オブジェクトを直接使いたい場合は、以下のように注入できます。

source: In case you are interested in using the `Liquibase` object directly, you can inject it as follows:
ja_jp: `Liquibase` オブジェクトを直接使用したい場合は、次のようにして注入します。

source: In case you are wondering about creating a new Quarkus extension and adding it to the Quarkus ecosystem so that the Quarkus community can discover it using the Quarkus dev tools (including the https://quarkus.io/guides/cli-tooling[Quarkus CLI] and https://code.quarkus.io[code.quarkus.io]), the https://github.com/quarkiverse[Quarkiverse Hub] GitHub organization will be a good home for it.
ja_jp: 新しいQuarkusエクステンションを作成してQuarkusエコシステムに追加し、QuarkusコミュニティがQuarkus開発ツール（ link:https://quarkus.io/guides/cli-tooling[Quarkus CLI]や link:https://code.quarkus.io[code.quarkus.io]を含む）を使用して発見できるようにしたいと考えている場合は、 link:https://github.com/quarkiverse[Quarkiverse Hub]GitHub organizationがそのための良い拠点となるでしょう。

source: In case you are wondering about creating a new Quarkus extension and adding it to the Quarkus ecosystem so that the Quarkus community can discover it using the Quarkus dev tools (including the xref:cli-tooling.adoc[Quarkus CLI] and https://code.quarkus.io[code.quarkus.io]), the https://github.com/quarkiverse[Quarkiverse Hub] GitHub organization will be a good home for it.
ja_jp: 新しいQuarkusエクステンションを作成してQuarkusエコシステムに追加し、Quarkus開発ツール（ xref:cli-tooling.adoc[Quarkus CLI] や link:https://code.quarkus.io[code.quarkus.io] を含む）を使用してQuarkusコミュニティがそのエクステンションを発見できるようにしたいと考えている場合、 link:https://github.com/quarkiverse[Quarkiverse Hub] GitHub organizationはそのための良いホームとなるでしょう。

source: In case you encounter the `org.bson.codecs.configuration.CodecConfigurationException` exception, it means the codec is not able to automatically convert your object. This codec obeys the Java Bean standard, so it will successfully convert a POJO using public fields or getters/setters. You can use `@BsonIgnore` to make a field, or a getter/setter, ignored by the codec.
ja_jp: `org.bson.codecs.configuration.CodecConfigurationException` の例外が発生した場合、コーデックがオブジェクトを自動的に変換できないことを意味します。このコーデックは、Java Bean 標準に準拠しているため、パブリックフィールドまたはゲッター/セッターを使用する POJO を正常に変換します。 `@BsonIgnore` を使用して、フィールドまたはゲッター/セッターをコーデックで無視することができます。

source: In case you find bugs or have ideas for some great new features, don't hesitate to head over to our https://github.com/redhat-developer/intellij-quarkus/issues[Github repository] and open a ticket.
ja_jp: バグを見つけたり、素晴らしい新機能のアイデアがある場合は、遠慮なく link:https://github.com/redhat-developer/intellij-quarkus/issues[Githubリポジトリ] にアクセスしてチケットを開いてください。

source: In case you have any issues with serializer auto-detection, you can switch it off completely by setting `quarkus.messaging.pulsar.serializer-autodetection.enabled=false`. If you find you need to do this, please file a bug in the link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] so we can fix whatever problem you have.
ja_jp: シリアライザーの自動検出に問題がある場合は、 `quarkus.messaging.pulsar.serializer-autodetection.enabled=false` を設定することで、これを完全にオフにすることができます。 オフにする必要があると認識した場合は、link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] にバグを報告していただければ、どのような問題でも修正することができます。

source: In case you have any issues with serializer autodetection, you can switch it off completely by setting `quarkus.messaging.kafka.serializer-autodetection.enabled=false`. If you find you need to do this, please file a bug in the link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] so we can fix whatever problem you have.
ja_jp: シリアライザーの自動検出に問題がある場合は、 `quarkus.messaging.kafka.serializer-autodetection.enabled=false` を設定することで、これを完全にオフにすることができます。 オフにする必要がある場合は、link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] にバグを報告していただければ、問題を解決します。

source: In case you have any issues with serializer autodetection, you can switch it off completely by setting `quarkus.reactive-messaging.kafka.serializer-autodetection.enabled=false`. If you find you need to do this, please file a bug in the link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] so we can fix whatever problem you have.
ja_jp: シリアライザーの自動検出に問題がある場合は、 `quarkus.reactive-messaging.kafka.serializer-autodetection.enabled=false` を設定することで、これを完全にオフにすることができます。オフにする必要があると認識した場合は、link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] にバグを報告していただければ、どのような問題でも修正することができます。

source: In case you have questions, suggestions or something else, please feel free to contact me on https://twitter.com/bennetelli[Twitter].
ja_jp: 万が一、質問や提案などがありましたら、お気軽に link:https://twitter.com/bennetelli[Twitter]でご連絡ください。

source: In case you want to project an entity in a class with nested classes, you can use the `@NestedProjectedClass` annotation on those nested classes.
ja_jp: ネストされたクラスを持つクラスでエンティティを投影したい場合は、それらのネストされたクラスで `@NestedProjectedClass` アノテーションを使用できます。

source: In case you would like to share the Data Index instance between applications. Dev Services for Kogito implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single instance.
ja_jp: Data Indexのインスタンスをアプリケーション間で共有したい場合。Dev Services for Kogitoは、 _dev_ モードで動作する複数のQuarkusアプリケーションが1つのインスタンスを共有するための _サービスディスカバリー_ メカニズムを実装しています。

source: In cases that warrant using `InputStream` as the return type of REST Client method (such as when large amounts of data need to be read):
ja_jp: REST Client メソッドの戻り値の型として `InputStream` を使用する必要がある場合 (大量のデータを読み取る必要がある場合など) は、以下のようになります。

source: In cases were utilities or automatic instrumentation is not available, manual instrumentation can be used to generate spans, propagate the OpenTelemetry context and the Baggage.
ja_jp: ユーティリティーまたは自動計装が利用できない場合、手動計装を使用してスパンを生成し、OpenTelemetry コンテキストと Baggage を伝播することができます。

source: In cases where Flyway needs to be configured in addition to the configuration options that Quarkus provides, the `io.quarkus.flyway.FlywayConfigurationCustomizer` class comes in handy.
ja_jp: Quarkusが提供する設定オプションに加えてFlywayを設定する必要がある場合、 `io.quarkus.flyway.FlywayConfigurationCustomizer` クラスが便利です。

source: In cases where some fields of an object to be recorded should be ignored (i.e. the value that being at build time should not be reflected at runtime), the `@IgnoreProperty` can be placed on the field.
ja_jp: 記録するオブジェクトの一部のフィールドを無視する必要がある場合（ビルド時に存在する値を実行時に反映させるべきではない場合）には、そのフィールドに `@IgnoreProperty` を配置することができます。

source: In cases where the multipart content needs to be built up programmatically, the REST Client provides `ClientMultipartForm` which can be used in the REST Client like so:
ja_jp: マルチパートコンテンツをプログラムで構築する必要がある場合、REST Client は次のように REST Client で使用できる `ClientMultipartForm` を提供します。

source: In certain cases you might need to execute methods and/or get data against the deployment classpath. This also happens over JsonRPC communication, but in this case you do not create a JsonRPC Service in the runtime module, you can just supply the code to be run in a supplier in the deployment module. To do this you will produce a `BuildTimeActionBuildItem`, example:
ja_jp: 場合によっては、デプロイメントクラスパスに対してメソッドを実行したり、データを取得したりする必要があるかもしれません。同様の状況は JsonRPC 通信でも発生しますが、その場合はランタイムモジュールに JsonRPC サービスは作成せず、 デプロイメントモジュールのサプライヤーで実行されるコードを提供します。これを行うには、以下のように `BuildTimeActionBuildItem` を作成します。

source: In certain cases, Quarkus may copy modified versions of dependency artifacts to an application distribution. Manipulating the original content of a component will change its hash sums which may get highlighted as suspicious by the tools comparing original component hash sums to those found in the distribution.
ja_jp: Quarkus が、依存関係アーティファクトの変更されたバージョンをアプリケーションディストリビューションにコピーする場合もあります。コンポーネントの元のコンテンツを操作するとハッシュサムが変更され、元のコンポーネントハッシュサムとディストリビューションで見つかったハッシュサムを比較するツールによって疑わしいものとして強調表示される可能性があります。

source: In certain cases, a more fine-grained approach might be needed which is why Quarkus also exposes `java.util.concurrent.ScheduledExecutorService` and `java.util.concurrent.ExecutorService` that can be injected as CDI beans. However, these executors are used by other Quarkus extensions and therefore should be approached with caution. Furthermore, users are never allowed to shut these executors down manually.
ja_jp: 場合によっては、詳細にわたるアプローチが必要になることがあります。そのため、Quarkus は CDI Bean として注入できる `java.util.concurrent.ScheduledExecutorService` と `java.util.concurrent.ExecutorService` も公開しています。 ただし、これらのエグゼキューターは他の Quarkus エクステンションによって使用されるため、注意して使用する必要があります。さらに、ユーザーがこれらのエグゼキューターを手動でシャットダウンすることは許可されていません。

source: In certain circumstances, you may want to build the native image in a separate step. For example, in a CI/CD pipeline, you may want to have one step to generate the source that will be used for the native image generation and another step to use these sources to actually build the native executable. For this use case, you can set the `quarkus.package.type=native-sources`. This will execute the java compilation as if you had started native compilation (`-Pnative`), but stops before triggering the actual call to GraalVM's `native-image`.
ja_jp: 特定の状況では、別のステップでネイティブイメージをビルドする必要がある場合もあります。たとえば、CI/CD パイプラインで、ネイティブイメージの生成に使用するソースを生成するステップと、これらのソースを使用して実際にネイティブ実行可能ファイルをビルドするステップを分けたい場合などです。このようなユースケースでは、 `quarkus.package.type=native-sources` を設定できます。そうすることで、ネイティブコンパイル (`-Pnative`) を開始するように Java コンパイルを実行できますが、GraalVM の `native-image` の実際の呼び出しをトリガーする前に停止します。

source: In certain circumstances, you may want to build the native image in a separate step. For example, in a CI/CD pipeline, you may want to have one step to generate the source that will be used for the native image generation and another step to use these sources to actually build the native executable. For this use case, you can set the `quarkus.package.type=native-sources`. This will execute the java compilation as if you would have started native compilation (`-Pnative`), but stops before triggering the actual call to GraalVM's `native-image`.
ja_jp: 状況によっては、ネイティブイメージを別のステップでビルドしたい場合があります。 例えば、CI/CDパイプラインでは、ネイティブ・イメージの生成に使用するソースを生成するステップと、これらのソースを使用して実際にネイティブ実行可能ファイルをビルドするステップを用意したい場合があります。 このような場合、 `quarkus.package.type=native-sources` を設定することができます。 ネイティブ・コンパイル（ `-Pnative` ）を開始したのと同じようにjavaのコンパイルが実行されますが、GraalVMの `native-image` を実際に呼び出す前に停止します。

source: In certain circumstances, you may want to build the native image in a separate step. For example, in a CI/CD pipeline, you may want to have one step to generate the source that will be used for the native image generation and another step to use these sources to actually build the native executable. For this use case, you can set the additional flag `quarkus.native.sources-only=true`. This will execute the java compilation as if you had started native compilation (`-Dnative`), but stops before triggering the actual call to GraalVM's `native-image`.
ja_jp: 特定の状況では、別のステップでネイティブイメージをビルドする必要がある場合もあります。 たとえば、CI/CD パイプラインで、ネイティブイメージの生成に使用するソースを生成するステップと、これらのソースを使用して実際にネイティブ実行可能ファイルをビルドするステップを分けたい場合などです。 このようなユースケースでは、追加フラグとして `quarkus.native.sources-only=true` を設定できます。 そうすることで、ネイティブコンパイル (`-Dnative`) を開始するように Java コンパイルを実行できますが、GraalVM の `native-image` の実際の呼び出しをトリガーする前に停止します。

source: In certain situations, it is practical to obtain a bean instance programmatically via an injected `jakarta.enterprise.inject.Instance` and `Instance.get()`. However, according to the specification the `get()` method must identify the matching bean and obtain a contextual reference. As a consequence, a new instance of a `@Dependent` bean is returned from each invocation of `get()`. Moreover, this instance is a dependent object of the injected `Instance`. This behavior is well-defined, but it may lead to unexpected errors and memory leaks. Therefore, Quarkus comes with the `io.quarkus.arc.WithCaching` annotation. An injected `Instance` annotated with this annotation will cache the result of the `Instance#get()` operation. The result is computed on the first call and the same value is returned for all subsequent calls, even for `@Dependent` beans.
ja_jp: 特定の状況では、注入された `jakarta.enterprise.inject.Instance` と `Instance.get()` を介してプログラムで Bean インスタンスを取得することが実用的です。 ただし、仕様によれば、 `get()` メソッドは一致する Bean を識別し、コンテキスト参照を取得する必要があります。 その結果、 `get()` の各呼び出しから `@Dependent` Bean の新しいインスタンスが返されます。 さらに、このインスタンスは、注入された `Instance` の依存オブジェクトです。 この動作は明確に定義されていますが、予期しないエラーやメモリーリークが発生する可能性があります。 そのため、Quarkus には `io.quarkus.arc.WithCaching` アノテーションが付属しています。 このアノテーションが付けられた挿入された `Instance` は、 `Instance#get()` 操作の結果をキャッシュします。 結果は最初の呼び出しで計算され、 `@Dependent` Bean の場合でも、後続のすべての呼び出しに対して同じ値が返されます。

source: In certain situations, it is practical to obtain a bean instance programmatically via an injected `jakarta.enterprise.inject.Instance` and `Instance.get()`. However, according to the specification, the `get()` method must identify the matching bean and obtain a contextual reference. As a consequence, a new instance of a `@Dependent` bean is returned from each invocation of `get()`. Moreover, this instance is a dependent object of the injected `Instance`. This behavior is well-defined, but it may lead to unexpected errors and memory leaks. Therefore, Quarkus comes with the `io.quarkus.arc.WithCaching` annotation. An injected `Instance` annotated with this annotation will cache the result of the `Instance#get()` operation. The result is computed on the first call, and the same value is returned for all subsequent calls, even for `@Dependent` beans.
ja_jp: 特定の状況では、注入された `jakarta.enterprise.inject.Instance` と `Instance.get()` を介してプログラムで Bean インスタンスを取得することが実用的です。ただし、仕様によると、`get()` メソッドは一致する Bean を識別し、コンテキスト参照を取得する必要があります。その結果、`get()` の各呼び出しから `@Dependent` Bean の新しいインスタンスが返されます。さらに、このインスタンスは、注入された `Instance` の依存オブジェクトです。この動作は明確に定義されていますが、予期しないエラーやメモリーリークにつながる可能性があります。そのため、Quarkus には `io.quarkus.arc.WithCaching` アノテーションが付属しています。このアノテーションが付けられた注入された `Instance` は、`Instance#get()` 操作の結果をキャッシュします。結果は最初の呼び出しで計算され、`@Dependent` Bean の場合でも、後続のすべての呼び出しに対して同じ値が返されます。
